Gestión de las Tablas
===

**Juan David Velásquez Henao**  
jdvelasq@unal.edu.co   
Universidad Nacional de Colombia, Sede Medellín  
Facultad de Minas  
Medellín, Colombia

---

Haga click [aquí](https://github.com/jdvelasq/SQL-basics) para acceder al repositorio en GitHub.

Haga click [aquí](http://nbviewer.jupyter.org/github/jdvelasq/SQL-basics/tree/master/) para explorar el repositorio usando en `nbviewer`.

---

In [1]:
## conexión a la base de datos
%load_ext sql
%sql mysql+pymysql://root:root@localhost
%sql DROP DATABASE IF EXISTS sqldemo;
%sql CREATE DATABASE sqldemo;
%sql USE sqldemo;

**CREATE TABLE**

    CREATE TABLE [IF NOT EXISTS] tbl_name
        (create_definition,...)
    
    create_definition:
        col_name  column_definition
       
    column_definition:
        data_type 
            [NOT NULL | NULL] 
            [DEFAULT default_value]
            [AUTO_INCREMENT] 
            [UNIQUE [KEY]] 
            [[PRIMARY] KEY]
           
    data_type:
        BIT[(length)]
        | TINYINT[(length)] [UNSIGNED] [ZEROFILL]
        | SMALLINT[(length)] [UNSIGNED] [ZEROFILL]
        | MEDIUMINT[(length)] [UNSIGNED] [ZEROFILL]
        | INT[(length)] [UNSIGNED] [ZEROFILL]
        | INTEGER[(length)] [UNSIGNED] [ZEROFILL]
        | BIGINT[(length)] [UNSIGNED] [ZEROFILL]
        | REAL[(length,decimals)] [UNSIGNED] [ZEROFILL]
        | DOUBLE[(length,decimals)] [UNSIGNED] [ZEROFILL]
        | FLOAT[(length,decimals)] [UNSIGNED] [ZEROFILL]
        | DECIMAL[(length[,decimals])] [UNSIGNED] [ZEROFILL]
        | NUMERIC[(length[,decimals])] [UNSIGNED] [ZEROFILL]
        | DATE
        | TIME[(fsp)]
        | TIMESTAMP[(fsp)]
        | DATETIME[(fsp)]
        | YEAR
        | CHAR[(length)] 
        | VARCHAR(length) 
        | BINARY[(length)]
        | VARBINARY(length)
        | TINYTEXT
        | TEXT[(length)]
        | MEDIUMTEXT
        | LONGTEXT
        | ENUM(value1,value2,value3,...)
        | SET(value1,value2,value3,...)

In [8]:
%%sql
##
## crea la tabla
##
CREATE TABLE persons (
    id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    ssn VARCHAR(11),
    phone VARCHAR(14),
    city VARCHAR(30),
    maritalstatus VARCHAR(10),
    fullname VARCHAR(40),
    birthday DATE
);

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.

[]

---
**Ejercicio.--** Describa que devuelve el comando:

    SHOW TABLES;
    
**Ejercicio.--** Describa que devuelve el comando:

    SHOW CREATE TABLE persons;
    
**Ejercicio.--** Describa que devuelve el comando:

    DESCRIBE persons;
    
---

**ALTER TABLE**

    ALTER TABLE tbl_name (alter_definition, ...)
    
    alter_definition:
        ADD column_name column_definition [FIRST | AFTER column_name]
        | MODIFY column_name  column_definition
        | DROP column_name

In [10]:
%%sql
## 
## Agrega un nuevo campo.
##
ALTER TABLE persons ADD state varchar(20) AFTER city;
DESCRIBE persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.
8 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('ssn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('state', 'varchar(20)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

In [11]:
%%sql
## 
## Modifica el tamaño de un campo.
##
ALTER TABLE persons MODIFY state varchar(25);
DESCRIBE persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.
8 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('ssn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('state', 'varchar(25)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

In [12]:
%%sql
##
## Borra un campo.
##
ALTER TABLE persons DROP state;
DESCRIBE persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.
7 rows affected.

[('id', 'int(11)', 'NO', 'PRI', None, 'auto_increment'),
 ('ssn', 'varchar(11)', 'YES', '', None, ''),
 ('phone', 'varchar(14)', 'YES', '', None, ''),
 ('city', 'varchar(30)', 'YES', '', None, ''),
 ('maritalstatus', 'varchar(10)', 'YES', '', None, ''),
 ('fullname', 'varchar(40)', 'YES', '', None, ''),
 ('birthday', 'date', 'YES', '', None, '')]

In [13]:
%%sql
##
## Borrado de tablas:
##
# DROP TABLE persons;
DROP TABLE IF EXISTS persons;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

---

Gestión de las Tablas
===

**Juan David Velásquez Henao**  
jdvelasq@unal.edu.co   
Universidad Nacional de Colombia, Sede Medellín  
Facultad de Minas  
Medellín, Colombia

---

Haga click [aquí](https://github.com/jdvelasq/SQL-basics) para acceder al repositorio en GitHub.

Haga click [aquí](http://nbviewer.jupyter.org/github/jdvelasq/SQL-basics/tree/master/) para explorar el repositorio usando en `nbviewer`.